CREATE TABLE IF NOT EXISTS stations(
    id SERIAL PRIMARY KEY,
    title VARCHAR(25) NOT NULL,
    railway_id INTEGER NOT NULL,
    code VARCHAR(6) NOT NULL UNIQUE,
    has_turnout_point BOOLEAN DEFAULT FALSE,

    FOREIGN KEY (railway_id) REFERENCES railways(id) ON DELETE CASCADE
);

INSERT INTO stations (title, railway_id, code)
VALUES
    ('Входная', 5, '083020'),
    ('Карбышево-II', 5, '083266'),
    ('Фадино', 5, '083261'),
    ('Стрела', 5, '083450'),
    ('Жатва', 5, '083460'),
    ('Любовка', 5, '083470'),
    ('Иртышское', 5, '083500'),

    ('Карбышево-I', 5, '083030'),
    ('Омск-Пассажирский', 5, '083070'),
    ('Московка', 5, '083000'),
    ('Сыропятское', 5, '083004'),
    ('Кормиловка', 5, '083270'),
    ('Калачинская', 5, '083280'),
    ('Валерино', 5, '083283'),
    ('Колония', 5, '083290'),
    ('Каратканск', 5, '083293'),
    ('Татарская', 5, '083300'),
    ('Кабаклы', 5, '083304'),
    ('Чаны', 5, '083330'),
    ('Озеро Карачинское', 5, '083346'),
    ('Тебисская', 5, '083359'),
    ('Кирзинское', 5, '083355'),
    ('Барабинск', 5, '083360'),

    ('Пламя', 5, '083010'),
    ('Петрушенко', 5, '083051'),
    ('Любинская', 5, '083180'),
    ('Драгунская', 5, '083176'),
    ('Кочковатский', 5, '083164'),
    ('Называевская', 5, '083160'),
    ('Восточный (ОП-46)', 12, '079203'),
    ('Мангут', 12, '079207'),
    ('Новоандреевский', 12, '079190'),
    ('Маслянская', 12, '079180'),
    ('Шаблыкино', 12, '079174'),
    ('Малый Остров', 12, '079162'),
    ('Ишим', 12, '079160'),

    ('Лузино', 5, '083252'),
    ('Мариановка', 5, '083240'),
    ('Пикетное', 5, '083230'),
    ('Москаленки', 5, '083220'),
    ('Исилькуль', 5, '083200'),
    ('Кара-Гуга', 16, '082516'),
    ('Булаево', 16, '082520'),
    ('Ганькино', 16, '082524'),
    ('Токуши', 16, '082607'),
    ('Петропавловск', 16, '082000'),

    ('Комбинатская', 5, '083150'),
    ('Омск-Восточный', 5, '083120'),
    ('Омск-Северный', 5, '083140'),
    ('Универсальная', 5, '083131'),
    ('Левобережный (разъезд)', 5, '083141');

UPDATE stations
SET has_turnout_point = TRUE
WHERE id IN (1, 7, 9, 10, 23, 36, 46, 47);
