CREATE TABLE IF NOT EXISTS locomotive_series(
    id SERIAL PRIMARY KEY,
    title VARCHAR(8) NOT NULL UNIQUE
);

INSERT INTO locomotive_series (title)
VALUES
    ('ВЛ10'),
    ('ВЛ10к'),
    ('1.5ВЛ10к'),
    ('2ВЛ10к'),
    ('ВЛ10п'),
    ('ВЛ10у'),
    ('ВЛ11'),
    ('ВЛ11м'),
    ('ВЛ11к'),
    ('1.5ВЛ11к'),
    ('2ВЛ11к'),
    ('2ЭС6'),
    ('3ЭС6'),
    ('3ЭС8'),
    ('2ЭС10'),
    ('Э5К'),
    ('2ЭС5К'),
    ('3ЭС5К'),
    ('4ЭС5К'),
    ('ВЛ60'),
    ('ВЛ60п'),
    ('ВЛ60р'),
    ('ВЛ60к'),
    ('ВЛ60пк'),
    ('ВЛ60ку'),
    ('ВЛ80с'),
    ('ВЛ80т'),
    ('ВЛ80р'),
    ('ВЛ80к'),

    ('ТЭМ2'),
    ('ТЭМ7'),
    ('ТЭМ18ДМ'),
    ('ЧМЭ3');
